In [22]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [23]:
df=pd.read_csv('datasets/banking_dirty.csv', index_col=0)
df.head()

,cust_id,birth_date,Age,acct_amount,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction
0,870A9281,1962-06-09,58,63523.31,51295,30105.0,4138.0,1420.0,15632.0,02-09-18,22-02-19
1,166B05B0,1962-12-16,58,38175.46,15050,4995.0,938.0,6696.0,2421.0,28-02-19,31-10-18
2,BFC13E88,1990-09-12,34,59863.77,24567,10323.0,4590.0,8469.0,1185.0,25-04-18,02-04-18
3,F2158F66,1985-11-03,35,84132.10,23712,3908.0,492.0,6482.0,12830.0,07-11-17,08-11-18
4,7A73F334,1990-05-17,30,120512.00,93230,12158.4,51281.0,13434.0,18383.0,14-05-18,19-07-18

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 99
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   cust_id           100 non-null    object
 1   birth_date        100 non-null    object
 2   Age               100 non-null    int64
 3   acct_amount       100 non-null    float64
 4   inv_amount        100 non-null    int64
 5   fund_A            100 non-null    float64
 6   fund_B            100 non-null    float64
 7   fund_C            100 non-null    float64
 8   fund_D            100 non-null    float64
 9   account_opened    100 non-null    object
 10  last_transaction  100 non-null    object
dtypes: float64(5), int64(2), object(4)
memory usage: 9.4+ KB

In [25]:
df.describe

<bound method NDFrame.describe of      cust_id  birth_date  Age  acct_amount  inv_amount   fund_A   fund_B  \
0   870A9281  1962-06-09   58     63523.31       51295  30105.0   4138.0
1   166B05B0  1962-12-16   58     38175.46       15050   4995.0    938.0
2   BFC13E88  1990-09-12   34     59863.77       24567  10323.0   4590.0
3   F2158F66  1985-11-03   35     84132.10       23712   3908.0    492.0
4   7A73F334  1990-05-17   30    120512.00       93230  12158.4  51281.0
..       ...         ...  ...          ...         ...      ...      ...
95  CA507BA1  1974-08-10   46     12209.84        7515    190.0    931.0
96  B99CD662  1989-12-12   31     92838.44       49089   2453.0   7892.0
97  13770971  1984-11-29   36     92750.87       27962   3352.0   7547.0
98  93E78DA3  1969-12-14   51     41942.23       29662   1758.0  11174.0
99  AC91D689  1993-05-18   27     99490.61       32149   2184.0  17918.0

     fund_C   fund_D account_opened last_transaction
0    1420.0  15632.0       02-09-18         22-02-19
1    6696.0   2421.0       28-02-19         31-10-18
2    8469.0   1185.0       25-04-18         02-04-18
3    6482.0  12830.0       07-11-17         08-11-18
4   13434.0  18383.0       14-05-18         19-07-18
..      ...      ...            ...              ...
95   1451.0   4943.0       26-05-18         11-09-19
96  31486.0   7258.0       04-05-17         12-03-19
97   8486.0   8577.0       16-08-17         24-04-19
98  11650.0   5080.0       09-10-17         15-04-18
99   6714.0   5333.0       01-08-17         04-08-19

[100 rows x 11 columns]>

In [26]:
df.dtypes

cust_id              object
birth_date           object
Age                   int64
acct_amount         float64
inv_amount            int64
fund_A              float64
fund_B              float64
fund_C              float64
fund_D              float64
account_opened       object
last_transaction     object
dtype: object

In [27]:
df.birth_date= pd.to_datetime(df.birth_date)
df.account_opened=pd.to_datetime(df.account_opened)
df.last_transaction=pd.to_datetime(df.last_transaction)
df.dtypes

cust_id                     object
birth_date          datetime64[ns]
Age                          int64
acct_amount                float64
inv_amount                   int64
fund_A                     float64
fund_B                     float64
fund_C                     float64
fund_D                     float64
account_opened      datetime64[ns]
last_transaction    datetime64[ns]
dtype: object

In [36]:
# lets check for frauds
df['calculated_amt']=df.fund_A+df.fund_B+df.fund_C+df.fund_D
df.head()

,cust_id,birth_date,Age,acct_amount,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction,amount,calculated_amt
0,870A9281,1962-06-09,58,63523.31,51295,30105.0,4138.0,1420.0,15632.0,2018-02-09,2019-02-22,51295.0,51295.0
1,166B05B0,1962-12-16,58,38175.46,15050,4995.0,938.0,6696.0,2421.0,2019-02-28,2018-10-31,15050.0,15050.0
2,BFC13E88,1990-09-12,34,59863.77,24567,10323.0,4590.0,8469.0,1185.0,2018-04-25,2018-02-04,24567.0,24567.0
3,F2158F66,1985-11-03,35,84132.10,23712,3908.0,492.0,6482.0,12830.0,2017-07-11,2018-08-11,23712.0,23712.0
4,7A73F334,1990-05-17,30,120512.00,93230,12158.4,51281.0,13434.0,18383.0,2018-05-14,2018-07-19,95256.4,95256.4

In [37]:
df.inv_amount[lambda x: if x!=df.calculated_amt]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().